{
  "_attn_implementation_autoset": true,
  "_name_or_path": "alibaba-damo/mgp-str-base",
  "architectures": [
    "MGPSTRModel"
  ],
  "attn_drop_rate": 0.0,
  "distilled": false,
  "drop_path_rate": 0.0,
  "drop_rate": 0.0,
  "hidden_size": 768,
  "image_size": [
    32,
    128
  ],
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "max_token_length": 27,
  "mlp_ratio": 4,
  "model_type": "mgp-str",
  "num_attention_heads": 12,
  "num_bpe_labels": 50257,
  "num_channels": 3,
  "num_character_labels": 38,
  "num_hidden_layers": 12,
  "num_wordpiece_labels": 30522,
  "output_a3_attentions": false,
  "patch_size": 4,
  "qkv_bias": true,
  "transformers_version": "4.46.1"
}
