{
  "added_tokens_decoder": {
    "0": {
      "content": "[GO]",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "[s]",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "bos_token": "[GO]",
  "clean_up_tokenization_spaces": false,
  "eos_token": "[s]",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "[GO]",
  "processor_class": "MgpstrProcessor",
  "tokenizer_class": "MgpstrTokenizer",
  "unk_token": "[GO]"
}
